In [1]:
import pandas as pd

In [4]:
list1 = list([[1,2,3,4],[3,4,5]])

In [5]:
type(list1)

list

In [6]:
print(list1)

[[1, 2, 3, 4], [3, 4, 5]]

In [7]:
import numpy as np

In [14]:
arr1 = np.array([[1,2,3],[2,3]])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  """Entry point for launching an IPython kernel.

In [15]:
arr1.shape

(2,)

In [16]:
df = pd.DataFrame()

In [17]:
print(df, type(df))

Empty DataFrame
Columns: []
Index: [] <class 'pandas.core.frame.DataFrame'>

In [18]:
ls = [1, 2, 3, 4]

In [22]:
df = pd.DataFrame(ls)

In [23]:
df

   0
0  1
1  2
2  3
3  4

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df1 = pd.Series(ls)
df1

0    1
1    2
2    3
3    4
dtype: int64

In [28]:
type(df[0])

pandas.core.series.Series

In [31]:
df[0].shape

(4,)

In [30]:
df.shape

(4, 1)

In [32]:
data = {
    'country': ['India', 'Nepal', 'Bangladesh'],
    'language' : ['Hindi', 'Nepali', 'Bengali']
}

In [33]:
country_lang = pd.DataFrame(data)
country_lang

      country language
0       India    Hindi
1       Nepal   Nepali
2  Bangladesh  Bengali

In [34]:
country_lang.shape

(3, 2)

In [38]:
type(country_lang['country'])

pandas.core.series.Series

In [42]:
type(country_lang[['language']])

pandas.core.frame.DataFrame

In [43]:
country_lang = pd.DataFrame(data, index=['IND','NEP','BAN'])
country_lang

        country language
IND       India    Hindi
NEP       Nepal   Nepali
BAN  Bangladesh  Bengali

In [44]:
timedata = {
    'feature1':[2,3,5,7],
    'feature2':[11,22,45,77]
}

timedf = pd.DatetimeIndex(['2020-12-01','2020-12-02','2020-12-03','2020-12-04'])

pd.DataFrame(timedata, index=timedf)

            feature1  feature2
2020-12-01         2        11
2020-12-02         3        22
2020-12-03         5        45
2020-12-04         7        77

In [48]:
pd.DataFrame({
    'A':np.random.randn(10),
    'B':np.random.randint(1,10,10,dtype=int).astype(np.float32),
    'C':np.random.random(10)
})

          A    B         C
0  0.206826  9.0  0.605217
1 -1.493042  8.0  0.030902
2  2.211749  5.0  0.454147
3  0.623390  4.0  0.398288
4  1.233927  2.0  0.794802
5  0.715558  1.0  0.618967
6  0.656425  3.0  0.011260
7  0.523872  4.0  0.661678
8 -0.873226  1.0  0.842133
9  1.360740  7.0  0.285826

In [49]:
# lets load the dataset

dataset = pd.read_csv('./sample_data/california_housing_test.csv')
dataset.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [50]:
dataset.shape

(3000, 9)

In [51]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           3000 non-null   float64
 1   latitude            3000 non-null   float64
 2   housing_median_age  3000 non-null   float64
 3   total_rooms         3000 non-null   float64
 4   total_bedrooms      3000 non-null   float64
 5   population          3000 non-null   float64
 6   households          3000 non-null   float64
 7   median_income       3000 non-null   float64
 8   median_house_value  3000 non-null   float64
dtypes: float64(9)
memory usage: 211.1 KB

In [52]:
temp_df = dataset.append(dataset)

In [53]:
temp_df.shape

(6000, 9)

In [54]:
temp_df.drop_duplicates()

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

In [55]:
data1 = pd.DataFrame({
    'y': [1,2,4,5,7],
    'x1': [44,55,77,98,112],
    'x2': [.1, .2, .4, .6, .8],
    'x3': [.232, .1, .11, .12, .1]
})

In [56]:
data1

   y   x1   x2     x3
0  1   44  0.1  0.232
1  2   55  0.2  0.100
2  4   77  0.4  0.110
3  5   98  0.6  0.120
4  7  112  0.8  0.100

In [59]:
data2 = pd.DataFrame({
    'y': [10,2,4,15,7],
    'x1': [144,55,77,198,112],
    'x2': [1.1, .2, .4, 1.6, .8],
    'x3': [1.232, .1, .11, 2.12, .1]
})

In [67]:
new_data = pd.concat([data1, data2]).reset_index(drop = True)

In [68]:
new_data.shape

(10, 4)

In [69]:
new_data

    y   x1   x2     x3
0   1   44  0.1  0.232
1   2   55  0.2  0.100
2   4   77  0.4  0.110
3   5   98  0.6  0.120
4   7  112  0.8  0.100
5  10  144  1.1  1.232
6   2   55  0.2  0.100
7   4   77  0.4  0.110
8  15  198  1.6  2.120
9   7  112  0.8  0.100

In [70]:
new_data.drop_duplicates(subset=['y'],keep='last',inplace=True)

In [71]:
new_data

    y   x1   x2     x3
0   1   44  0.1  0.232
3   5   98  0.6  0.120
5  10  144  1.1  1.232
6   2   55  0.2  0.100
7   4   77  0.4  0.110
8  15  198  1.6  2.120
9   7  112  0.8  0.100

In [77]:
new_data.iloc[1:4]

    y   x1   x2     x3
3   5   98  0.6  0.120
5  10  144  1.1  1.232
6   2   55  0.2  0.100

In [78]:
new_data.loc[3:6]

    y   x1   x2     x3
3   5   98  0.6  0.120
5  10  144  1.1  1.232
6   2   55  0.2  0.100

In [79]:
new_data.columns

Index(['y', 'x1', 'x2', 'x3'], dtype='object')

In [80]:
new_data.columns = ['Y', 'X1', 'X2', 'X3']

In [81]:
new_data

    Y   X1   X2     X3
0   1   44  0.1  0.232
3   5   98  0.6  0.120
5  10  144  1.1  1.232
6   2   55  0.2  0.100
7   4   77  0.4  0.110
8  15  198  1.6  2.120
9   7  112  0.8  0.100

In [82]:
new_data.rename(columns={
    'X1':'X0',
    'X2':'X1',
    'X3':'X2'
}, inplace = True)

In [83]:
new_data

    Y   X0   X1     X2
0   1   44  0.1  0.232
3   5   98  0.6  0.120
5  10  144  1.1  1.232
6   2   55  0.2  0.100
7   4   77  0.4  0.110
8  15  198  1.6  2.120
9   7  112  0.8  0.100

In [88]:
new_data.columns = [col.lower() for col in new_data]
new_data

    y   x0   x1     x2
0   1   44  0.1  0.232
3   5   98  0.6  0.120
5  10  144  1.1  1.232
6   2   55  0.2  0.100
7   4   77  0.4  0.110
8  15  198  1.6  2.120
9   7  112  0.8  0.100

In [86]:
l1 = []
for l in new_data.columns:
  l1.append(l)

print(l1)

['Y', 'X0', 'X1', 'X2']

In [89]:
dataset.describe()

         longitude    latitude  ...  median_income  median_house_value
count  3000.000000  3000.00000  ...    3000.000000          3000.00000
mean   -119.589200    35.63539  ...       3.807272        205846.27500
std       1.994936     2.12967  ...       1.854512        113119.68747
min    -124.180000    32.56000  ...       0.499900         22500.00000
25%    -121.810000    33.93000  ...       2.544000        121200.00000
50%    -118.485000    34.27000  ...       3.487150        177650.00000
75%    -118.020000    37.69000  ...       4.656475        263975.00000
max    -114.490000    41.92000  ...      15.000100        500001.00000

[8 rows x 9 columns]

In [90]:
dataset['total_rooms'].describe()

count     3000.000000
mean      2599.578667
std       2155.593332
min          6.000000
25%       1401.000000
50%       2106.000000
75%       3129.000000
max      30450.000000
Name: total_rooms, dtype: float64

In [101]:
deptscore = pd.DataFrame({
    'Dept':['ECE','IT','EIE','CSE','ECE','IT','CSE','CSE','IT', 'IT'],
    'Score': [91,92,99.99,94,80,81,83,84,78,99]
})

In [105]:
deptscore.describe(include=['object'])

       Dept
count    10
unique    4
top      IT
freq      4

In [106]:
deptscore['Dept'].value_counts()

IT     4
CSE    3
ECE    2
EIE    1
Name: Dept, dtype: int64